{
    "intents": [
        {
            "tag": "saludo",
            "patterns": [
                "Hola",
                "¡Hola!",
                "Hey",
                "¡Buen día!",
                "Saludos",
                "¡Hola, qué tal!",
                "¡Hola! ¿Cómo estás?",
                "Hola, ¿en qué puedo ayudarte?",
                "¡Hey! ¿Necesitas algo?",
                "¡Hola! Espero que estés teniendo un buen día."
            ],
            "responses": [
                "Hola, soy una IA entrenada para responder tus preguntas. Dime en qué puedo ayudarte.",
                "¡Hola! Bienvenido, estoy aquí para ayudarte en lo que necesites.",
                "Hey, ¿cómo puedo asistirte hoy?",
                "¡Buen día! Si tienes alguna pregunta o necesitas información, estoy aquí para ayudarte.",
                "Saludos. Estoy aquí para proporcionarte información y respuestas.",
                "¡Hola, qué tal! Si necesitas alguna respuesta o consejo, no dudes en preguntar.",
                "¡Hola! ¿Cómo estás? Estoy listo para responder tus consultas.",
                "Hola, ¿en qué puedo colaborarte hoy?",
                "¡Hey! ¿En qué puedo ayudarte en este momento?",
                "¡Hola! Espero que estés teniendo un buen día. Estoy aquí para ayudarte en lo que necesites."
            ]
        },
        {
            "tag": "despedida",
            "patterns": [
                "Adios",
                "¡Adios!",
                "Hasta luego",
                "Nos vemos",
                "Chao",
                "Hasta la próxima",
                "¡Hasta pronto!",
                "Adiós, que tengas un buen día",
                "Cuidate",
                "¡Chao! Fue un placer ayudarte"
            ],
            "responses": [
                "Adios, un gusto atenderte.",
                "¡Hasta luego! Si necesitas más ayuda en el futuro, aquí estaré.",
                "Nos vemos. Espero que hayas encontrado lo que estabas buscando.",
                "Chao. Siempre estaré aquí si tienes más preguntas.",
                "Hasta la próxima. No dudes en regresar si necesitas más información.",
                "¡Hasta pronto! Siempre es un placer asistirte.",
                "Adiós, que tengas un buen día. Siempre estoy disponible si tienes más consultas.",
                "Cuídate y hasta la próxima vez.",
                "¡Chao! Fue un placer ayudarte. Siempre estaré aquí para responder tus inquietudes.",
                "Que tengas un excelente día. Si necesitas algo más, no dudes en preguntar."
            ]
        },
        {
            "tag": "nombre",
            "patterns": [
                "¿Cuál es tu nombre?",
                "¿Cómo te llamas?",
                "Dime tu nombre",
                "Nombre",
                "¿Puedes decirme tu nombre?"
            ],
            "responses": [
                "Mi nombre es Ruby, ¿en qué puedo ayudarte?",
                "Me llamo Ruby, estoy aquí para responder tus preguntas.",
                "Soy Ruby, una IA diseñada para asistirte con información y respuestas.",
                "Puedes llamarme Ruby. ¿En qué puedo colaborarte hoy?",
                "Mi nombre es Ruby. ¿Hay algo en particular en lo que necesitas ayuda?"
            ]
        },
        {
            "tag": "sustentabilidad",
            "patterns": [
                "¿Que es la sustentabilidad?"
            ],
            "responses": [
                "Es el desarrollo que satisface nuestras necesidades sin comprometer los recursos y oportunidades para el crecimiento y desarrollo de las generaciones futuras."
            ]
        },
        {
            "tag": "sostenibilidad",
            "patterns": [
                "¿Que es la sostenibilidad?"
            ],
            "responses": [
                "Aquello que se puede mantener durante largo tiempo sin agotar los recursos o causar grave daño al medio ambiente"
            ]
        },
        {
            "tag": "diferencias sustentable y sostenible",
            "patterns": [
                "¿Cual es la diferencia entre sustentable y sostenible?",
                "¿Cual es la diferencia del sustentabilidad y sostenibilidad?"
            ],
            "responses": [
                "Ambas tienen el objetivo de preservar los recursos de nuestro planeta, no obstante, la principal diferencia entre la sostenibilidad y sustentabilidad, es que la primera se centra en estos recursos y su uso, mientras que la segunda tiene en cuenta toda una serie de procesos que buscan un cambio, medioambiental, social, economico, politico y cultural."
            ]
        },
        {
            "tag": "Que son las energias renovables",
            "patterns": [
                "¿Que son las energias renovables?",
                "¿Que es la energia renovable?"
            ],
            "responses": [
                "La energia se obtiene de fuentes naturales inagotables, ya sea por la inmensa cantidad de energia que contienen, o porque son capaces de regenerarse por medios naturales."
            ]
        },
        {
            "tag": "Cuales son las energias renovables",
            "patterns": [
                "¿Cuales son las energias renovables?",
                "¿Cuantas energias renovables son?"
            ],
            "responses": [
                "Entre las energias renovables se encuentran la eolica, geotermica, hidroelectrica, mareomotriz, solar, undimotriz, la biomasa y los biocarburantes."
            ]
        },
        {
            "tag": "Que es el reciclaje",
            "patterns": [
                "¿Que es el reciclaje?",
                "¿en que consiste el reciclaje?"
            ],
            "responses": [
                "El reciclaje es el proceso de convertir materiales usados o desechos en nuevos productos. Consiste en recolectar, clasificar y procesar los materiales reciclables para evitar que terminen en vertederos y contribuir asi a la reduccion de la demanda de recursos naturales y a la disminucion de la contaminacion."
            ]
        },
        {
            "tag": "Cuales materiales podemos reciclar",
            "patterns": [
                "¿Cuales materiales podemos reciclar?",
                "¿que materiales podemos reciclar?",
                "materiales a reciclar"
            ],
            "responses": [
                "Algunos materiales viables para reciclaje serian, cajas de papel corrugado, periodicos, latas de acero, recorte de hierba, latas de aluminio, botellas plasticas, revistas, envases de cristal, entre otros."
            ]
        },
        {
            "tag": "Que materiales no son seguros para depositar en la basura",
            "patterns": [
                "¿Que materiales no son seguros para depositar en la basura?",
                "¿que materiales no debemos tirar a la basura?",
                "¿que materiales no debemos tirar a la basura?",
                "materiales que no se deben de tirar a la basura"
            ],
            "responses": [
                "Algunos productos se denominan “desechos caseros peligrosos”, los cuales deben ser desechados adecuadamente, de lo contrario podrian causar daños a la salud y al medio ambiente, estos incluyen pinturas, aceites, baterias, pesticidas, etc."
            ]
        },
        {
            "tag": "Para que separamos la basura",
            "patterns": [
                "¿Para que separamos la basura?",
                "¿porque separamos la basura?",
                "¿porque deberiamos de separar la basura?",
                "¿Para que separo la basura?",
                "¿porque separo la basura?"
            ],
            "responses": [
                "Separamos los desechos porque gran parte de los residuos son reciclables y reutilizables, asi optimizamos su aprovechamiento."
            ]
        },
        {
            "tag": "Como podemos separar la basura",
            "patterns": [
                "¿Como podemos separar la basura?",
                "¿como separo la basura?",
                "¿como se separa la basura?"
            ],
            "responses": [
                "Existen varios metodos para separar la basura, pero el mas sencillo y aprobado seria en organicos e inorganicos."
            ]
        },
        {
            "tag": "Que son los residuos organicos y los inorganicos",
            "patterns": [
                "¿Que son los residuos organicos y los inorganicos?",
                "¿Que es el residuo organico e inorganico?",
                "¿Que es el residuos organico y el inorganico?",
                "¿Que es el residuos organico?",
                "¿Que es el residuos inorganico?"
            ],
            "responses": [
                "Se conoce a la basura organica como desecho que alguna vez estuvo vivo o es parte de un ser vivo y a la inorganica como desecho que no tiene origen biologico."
            ]
        },
        {
            "tag": "Como podriamos subclasificar la basura",
            "patterns": [
                "¿Como podriamos subclasificar la basura?",
                "¿como subclasificar la basura?",
                "¿como clasificar la basura?",
                "¿como clasifico la basura?"
            ],
            "responses": [
                "Existen clasificaciones especificas de los desechos segun su composicion, algunos de ellos son, tela, madera, papel, plastico, metal, vidrio, etc."
            ]
        },
        {
            "tag": "Que es una bioconstruccion",
            "patterns": [
                "¿Que es una bioconstruccion?",
                "¿Que es la bioconstruccion?"
            ],
            "responses": [
                "Es un sistema de construccion que respeta y preserva la vida de los habitantes y el entorno."
            ]
        },
        {
            "tag": "elementos basicos de una bioconstruccion",
            "patterns": [
                "¿Cuales son los elementos basicos de una bioconstruccion?",
                "¿que son los elementos basicos de una bioconstruccion?",
                "¿que elementos ocupo para una bioconstruccion?",
                "¿que necesito para una bioconstruccion?"
            ],
            "responses": [
                "Existen numerosos elementos, estos se modifican con el desarrollo de la tecnologia, pero los elementos base serian, la integracion en el entorno, materiales sanos y bio-compatibles, optimizacion de los recursos naturales, economizacion de la energia, equipo y mobiliario de bajo impacto, tratamiento de residuos, diseño y distribucion adecuada, entre otros."
            ]
        },
        {
            "tag": "Que es una casa sustentable",
            "patterns": [
                "¿Que es una casa sustentable?"
            ],
            "responses": [
                "Es una vivienda que busca aprovechar los recursos naturales de tal modo que las construcciones minimicen el impacto sobre el medio ambiente y sus habitantes."
            ]
        },
        {
            "tag": "elementos basicos de una casa sustentable",
            "patterns": [
                "¿Cuales son los elementos basicos de una casa sustentable?",
                "elementos basicos de una casa sustentable",
                "¿que ocupa una casa sustentable?",
                "¿que se necesita para una casa sustentable?"
            ],
            "responses": [
                "Materiales de construccion sostenibles, diseño y areas verdes eficientes y adecuadas a la ubicacion, iluminacion natural y led, buena ventilacion, sistemas de control de agua y reductores de energia, mobiliario de bajo impacto, aprovechamiento de los recursos naturales mediante diferentes instalaciones, como las celdas fotovoltaicas, calentador solar de agua, aerogeneradores, entre otros."
            ]
        },
        {
            "tag": "Que son las botellas de PET",
            "patterns": [
                "¿Que son las botellas de PET?",
                "¿Que es la botella de PET?",
                "¿Que es PET?"
            ],
            "responses": [
                "Son las siglas para el tereftalato de polietileno, las cuales son botellas de plastico comunmente utilizadas para envasar liquidos como agua, refrescos y productos de limpieza. Son livianas, transparentes y reciclables."
            ]
        },
        {
            "tag": "casa con botellas",
            "patterns": [
                "¿Para que sirve hacer una casa con botellas?",
                "¿Porque hacer una casa con botellas?",
                "para que hacer una casa con botellas?",
                "¿de que sirve una casa con botellas?"
            ],
            "responses": [
                "Tambien conocido como eco-construccion con botellas, nos permite aprovechar los residuos plasticos y reducir la cantidad de materiales de construccion contaminantes."
            ]
        },
        {
            "tag": "Como reducir el consumo de energia en la casa",
            "patterns": [
                "¿Como podemos reducir el consumo de energia en la casa?",
                "¿Como reducir el consumo de energia en la casa?",
                "¿Como puedo reducir el consumo de energia de mi casa?",
                "¿Como puedo reducir el consumo de energia en la casa?"
            ],
            "responses": [
                "Se pueden utilizar bombillas de bajo consumo energetico, apagar los dispositivos electronicos cuando no se utilizan, mejorar el aislamiento de la vivienda, utilizar electrodomesticos eficientes, aprovechar la luz natural y utilizar energias renovables."
            ]
        },
        {
            "tag": "Como reducir el consumo de agua en la casa",
            "patterns": [
                "¿Como podemos reducir el consumo de agua en la casa?",
                "¿Como reducir el consumo de agua en la casa?",
                "¿Como puedo reducir el consumo de agua de mi casa?",
                "¿Como puedo reducir el consumo de agua en la casa?"
            ],
            "responses": [
                "Podemos utilizar dispositivos de ahorro de agua en grifos y duchas, recoger agua de lluvia para riego, utilizar electrodomesticos eficientes en el uso del agua, y ser consciente del consumo al limpiar."
            ]
        },
        {
            "tag": "Que es la composta",
            "patterns": [
                "¿Que es la composta?"
            ],
            "responses": [
                "Tecnica donde se crean las condiciones necesarias para fabricar abono de calidad, mediante organismos descomponedores."
            ]
        },
        {
            "tag": "Como puedo hacer composta en mi hogar",
            "patterns": [
                "¿Como puedo hacer compostaje en mi hogar?",
                "¿Como puedo hacer composta en mi casa?",
                "¿Como hago compostaje en mi hogar?",
                "¿Como hago compostaje en mi casa?",
                "¿Como hacer composta?"
            ],
            "responses": [
                "Se utilizan contenedores cerrados de plastico o madera, se necesitan varias capas de residuos organicos, como cascaras de verduras y frutas, posos de cafe, hojarasca y tierra, se mantiene humedo, se mueve cada uno y tres semanas, con el tiempo, se convertiran en un abono."
            ]
        },
        {
            "tag": "Para que sirve un jardin aromatico",
            "patterns": [
                "¿Para que sirve un jardin aromatico?",
                "¿Para que sirve tener un jardin aromatico?",
                "¿porque tener un jardin aromatico?",
                "¿de que sirve tener un jardin aromatico?"
            ],
            "responses": [
                "Estos jardines pueden ser tanto decorativos como funcionales, ya que las plantas aromaticas pueden utilizarse para cocinar, hacer infusiones, perfumeria o simplemente para disfrutar de su fragancia."
            ]
        },
        {
            "tag": "Para que sirve un jardin para polinizadores",
            "patterns": [
                "¿Para que sirve un jardin para polinizadores?",
                "¿Para que sirve tener un jardin para polinizadores?",
                "¿porque tener un jardin para polinizadores?",
                "¿de que sirve tener un jardin para polinizadores?"
            ],
            "responses": [
                "Es un espacio diseñado para atraer y apoyar a los animales polinizadores, como insectos, aves y murcielagos. Estos jardines suelen incluir plantas con flores que proveen nectar y polen como fuente de alimento, asi como refugio y agua."
            ]
        },
        {
            "tag": "Que es un jardin de flora nativa",
            "patterns": [
                "¿Que es un jardin de flora nativa?",
                "¿Que es un jardin de flor nativa?"
            ],
            "responses": [
                "Consiste en cultivar y preservar plantas nativas de la region. Estas plantas son adaptadas al clima y a las condiciones locales, lo que las hace mas resistentes y menos dependientes de cuidados intensivos. Ademas, los jardines de flora nativa contribuyen a la conservacion de la biodiversidad local."
            ]
        },
        {
            "tag": "Para que funciona tener un jardin de flora nativa",
            "patterns": [
                "¿Para que sirve un jardin de flora nativa?",
                "¿Para que sirve tener un jardin de flora nativa?",
                "¿porque tener un jardin de flora nativa?",
                "¿de que sirve tener un jardin de flora nativa?"
            ],
            "responses": [
                "Puede ofrecer multiples beneficios, como la conservacion de especies nativas, la atraccion de fauna local, la reduccion del consumo de agua al utilizar plantas adaptadas al clima, la mejora de la calidad del suelo y la creacion de un entorno natural y esteticamente agradable."
            ]
        },
        {
            "tag": "sustentabilidad",
            "patterns": [
                "¿Que es la sustentabilidad?"
            ],
            "responses": [
                "Es el desarrollo que satisface nuestras necesidades sin comprometer los recursos y oportunidades para el crecimiento y desarrollo de las generaciones futuras."
            ]
        },
        {
            "tag": "sostenibilidad",
            "patterns": [
                "Que es la sostenibilidad?"
            ],
            "responses": [
                "Aquello que se puede mantener durante largo tiempo sin agotar los recursos o causar grave daño al medio ambiente"
            ]
        }
    ],
    "error": "Lo siento, no cuento con dicha informacion o no pude entender bien su pregunta. Intenta reformular tu pregunta o realizar una retroalimentacion."
}